(function () {

    window.data = {
        genre: ['Биография', 'Зарубежная классика', 'Русская классика', 'Современная литература', 'Триллер', 'Ужасы', 'Фэнтези'],
        status: ['Прочитано', 'Хочу прочитать', 'Читаю'],
        books: [
            {
                name: 'Финансист',
                author: 'Теодор Драйзер',
                genre: 'Зарубежная классика',
                status: 'Хочу прочитать',
            },
            {
                name: 'Братья Карамазовы',
                author: 'Ф.М. Достоевский',
                genre: 'Русская классика',
                status: 'Читаю',
            },
            {
                name: 'Идиот',
                author: 'Ф.М. Достоевский',
                genre: 'Русская классика',
                status: 'Прочитано',
            },
            {
                name: 'Волшебный корабль',
                author: 'Робин Хобб',
                genre: 'Фэнтези',
                status: 'Читаю',
            },
            {
                name: 'Владимир Набоков. Русские годы',
                author: 'Брайан Бойд',
                genre: 'Биография',
                status: 'Читаю',
            },
            {
                name: 'Улица теней, 77',
                author: 'Дин Кунц',
                genre: 'Триллер',
                status: 'Хочу прочитать',
            },
            {
                name: 'Никогде',
                author: 'Нил Гейман',
                genre: 'Фэнтези',
                status: 'Прочитано',
            },
            {
                name: 'Стража! Стража!',
                author: 'Терри Пратчетт',
                genre: 'Фэнтези',
                status: 'Прочитано',
            },
            {
                name: 'Оно',
                author: 'Стивен Кинг',
                genre: 'Ужасы',
                status: 'Прочитано',
            },
            {
                name: 'Спаситель и сын',
                author: 'Мари-Од Мюрай',
                genre: 'Современная литература',
                status: 'Хочу прочитать',
            },
            {
                name: 'Зима тревоги нашей',
                author: 'Джон Стейнбек',
                genre: 'Зарубежная классика',
                status: 'Хочу прочитать',
            },
            {
                name: 'Мисс Черити',
                author: 'Мари-Од Мюрай',
                genre: 'Современная литература',
                status: 'Хочу прочитать',
            },
            {
                name: 'Защита Лужина',
                author: 'В.В. Набоков',
                genre: 'Русская классика',
                status: 'Прочитано',
            },
            {
                name: 'Детская книга',
                author: 'Антония Байетт',
                genre: 'Современная литература',
                status: 'Хочу прочитать',
            },
            {
                name: 'Бесы',
                author: 'Ф.М. Достоевский',
                genre: 'Русская классика',
                status: 'Прочитано',
            },
            {
                name: 'Дар',
                author: 'В.В. Набоков',
                genre: 'Русская классика',
                status: 'Хочу прочитать',
            },
            {
                name: 'Лолита',
                author: 'В.В. Набоков',
                genre: 'Русская классика',
                status: 'Прочитано',
            },
            {
                name: 'Мелкие боги',
                author: 'Терри Пратчетт',
                genre: 'Фэнтези',
                status: 'Прочитано',
            },
            {
                name: 'Мрачный жнец',
                author: 'Терри Пратчетт',
                genre: 'Фэнтези',
                status: 'Хочу прочитать',
            },
        ]
    };
})();
